index=* sourcetype=suricata alert.signature="APTPACK EXEC Base64 Or Encoded Command Indicator"
| stats count by src_ip dest_ip alert.signature
| eval phase="EXEC", anti_bypass="true", severity="high"
