index=* sourcetype=suricata alert.signature="APTPACK CA Beacon Or C2 Checkin Pattern"
| stats count min(_time) as firstTime max(_time) as lastTime by src_ip dest_ip alert.signature
| eval phase="CA", mitre="T1071,T1105", severity="critical"
