index=* sourcetype=suricata alert.signature="APTPACK IA Suspicious Login POST"
| stats count min(_time) as firstTime max(_time) as lastTime by src_ip dest_ip alert.signature
| eval phase="IA", mitre="T1078,T1110", severity="high"
